MikroElektronika/core_packages/PIC/XC8/def/PIC18LF24K42/mcu.h
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR10,1)
// IPR10<CLC4IP>
extern volatile __bit                   CLC4IP              __at(0x1CC51);	// @ (0x398A * 8 + 1)
#define                                 CLC4IP_bit          _BIT_ACCESS(IPR10,1)
// PMD6<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x1CE34);	// @ (0x39C6 * 8 + 4)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD6,4)
// CLCDATA0<CLC4OUT>
extern volatile __bit                   CLC4OUT             __at(0x1E3F3);	// @ (0x3C7E * 8 + 3)
#define                                 CLC4OUT_bit         _BIT_ACCESS(CLCDATA0,3)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x1E730);	// @ (0x3CE6 * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x1E731);	// @ (0x3CE6 * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x1E732);	// @ (0x3CE6 * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK3>
extern volatile __bit                   CLKRCLK3            __at(0x1E733);	// @ (0x3CE6 * 8 + 3)
#define                                 CLKRCLK3_bit        _BIT_ACCESS(CLKRCLK,3)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x1E72B);	// @ (0x3CE5 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x1E72C);	// @ (0x3CE5 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x1E728);	// @ (0x3CE5 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x1E729);	// @ (0x3CE5 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x1E72A);	// @ (0x3CE5 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x1E72F);	// @ (0x3CE5 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x1CE01);	// @ (0x39C0 * 8 + 1)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,1)
// SPI1CLK<CLKSEL0>
extern volatile __bit                   CLKSEL0             __at(0x1E8E0);	// @ (0x3D1C * 8 + 0)
#define                                 CLKSEL0_bit         _BIT_ACCESS(SPI1CLK,0)
// SPI1CLK<CLKSEL1>
extern volatile __bit                   CLKSEL1             __at(0x1E8E1);	// @ (0x3D1C * 8 + 1)
#define                                 CLKSEL1_bit         _BIT_ACCESS(SPI1CLK,1)
// SPI1CLK<CLKSEL2>
extern volatile __bit                   CLKSEL2             __at(0x1E8E2);	// @ (0x3D1C * 8 + 2)
#define                                 CLKSEL2_bit         _BIT_ACCESS(SPI1CLK,2)
// SPI1CLK<CLKSEL3>
extern volatile __bit                   CLKSEL3             __at(0x1E8E3);	// @ (0x3D1C * 8 + 3)
#define                                 CLKSEL3_bit         _BIT_ACCESS(SPI1CLK,3)
// MD1CON1<CLPOL>
extern volatile __bit                   CLPOL               __at(0x1E7D9);	// @ (0x3CFB * 8 + 1)
#define                                 CLPOL_bit           _BIT_ACCESS(MD1CON1,1)
// MD1CON1<CLSYNC>
extern volatile __bit                   CLSYNC              __at(0x1E7D8);	// @ (0x3CFB * 8 + 0)
#define                                 CLSYNC_bit          _BIT_ACCESS(MD1CON1,0)
// PMD2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x1CE11);	// @ (0x39C2 * 8 + 1)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD2,1)
// PMD2<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x1CE12);	// @ (0x39C2 * 8 + 2)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMD2,2)
// I2C1PIE<CNT1IE>
extern volatile __bit                   CNT1IE              __at(0x1EBD7);	// @ (0x3D7A * 8 + 7)
#define                                 CNT1IE_bit          _BIT_ACCESS(I2C1PIE,7)
// I2C1PIR<CNT1IF>
extern volatile __bit                   CNT1IF              __at(0x1EBCF);	// @ (0x3D79 * 8 + 7)
#define                                 CNT1IF_bit          _BIT_ACCESS(I2C1PIR,7)
// I2C2PIE<CNT2IE>
extern volatile __bit                   CNT2IE              __at(0x1EB27);	// @ (0x3D64 * 8 + 7)
#define                                 CNT2IE_bit          _BIT_ACCESS(I2C2PIE,7)
// I2C2PIR<CNT2IF>
extern volatile __bit                   CNT2IF              __at(0x1EB1F);	// @ (0x3D63 * 8 + 7)
#define                                 CNT2IF_bit          _BIT_ACCESS(I2C2PIR,7)
// ADCON0<CONT>
extern volatile __bit                   CONT                __at(0x1F7C6);	// @ (0x3EF8 * 8 + 6)
#define                                 CONT_bit            _BIT_ACCESS(ADCON0,6)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x1CED4);	// @ (0x39DA * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x1CED5);	// @ (0x39DA * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x1CED6);	// @ (0x39DA * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// SMT1CON0<CPOL>
extern volatile __bit                   CPOL                __at(0x1F8F2);	// @ (0x3F1E * 8 + 2)
#define                                 CPOL_bit            _BIT_ACCESS(SMT1CON0,2)
// ADCP<CPON>
extern volatile __bit                   CPON                __at(0x1F6BF);	// @ (0x3ED7 * 8 + 7)
#define                                 CPON_bit            _BIT_ACCESS(ADCP,7)
// SMT1CPRL<CPR0>
extern volatile __bit                   CPR0                __at(0x1F8A8);	// @ (0x3F15 * 8 + 0)
#define                                 CPR0_bit            _BIT_ACCESS(SMT1CPRL,0)
// SMT1CPRL<CPR1>
extern volatile __bit                   CPR1                __at(0x1F8A9);	// @ (0x3F15 * 8 + 1)
#define                                 CPR1_bit            _BIT_ACCESS(SMT1CPRL,1)
// SMT1CPRH<CPR10>
extern volatile __bit                   CPR10               __at(0x1F8B2);	// @ (0x3F16 * 8 + 2)
#define                                 CPR10_bit           _BIT_ACCESS(SMT1CPRH,2)
// SMT1CPRH<CPR11>
extern volatile __bit                   CPR11               __at(0x1F8B3);	// @ (0x3F16 * 8 + 3)
#define                                 CPR11_bit           _BIT_ACCESS(SMT1CPRH,3)
// SMT1CPRH<CPR12>
extern volatile __bit                   CPR12               __at(0x1F8B4);	// @ (0x3F16 * 8 + 4)
#define                                 CPR12_bit           _BIT_ACCESS(SMT1CPRH,4)
// SMT1CPRH<CPR13>
extern volatile __bit                   CPR13               __at(0x1F8B5);	// @ (0x3F16 * 8 + 5)
#define                                 CPR13_bit           _BIT_ACCESS(SMT1CPRH,5)
// SMT1CPRH<CPR14>
extern volatile __bit                   CPR14               __at(0x1F8B6);	// @ (0x3F16 * 8 + 6)
#define                                 CPR14_bit           _BIT_ACCESS(SMT1CPRH,6)
// SMT1CPRH<CPR15>
extern volatile __bit                   CPR15               __at(0x1F8B7);	// @ (0x3F16 * 8 + 7)
#define                                 CPR15_bit           _BIT_ACCESS(SMT1CPRH,7)
// SMT1CPRU<CPR16>
extern volatile __bit                   CPR16               __at(0x1F8B8);	// @ (0x3F17 * 8 + 0)
#define                                 CPR16_bit           _BIT_ACCESS(SMT1CPRU,0)
// SMT1CPRU<CPR17>
extern volatile __bit                   CPR17               __at(0x1F8B9);	// @ (0x3F17 * 8 + 1)
#define                                 CPR17_bit           _BIT_ACCESS(SMT1CPRU,1)
// SMT1CPRU<CPR18>
extern volatile __bit                   CPR18               __at(0x1F8BA);	// @ (0x3F17 * 8 + 2)
#define                                 CPR18_bit           _BIT_ACCESS(SMT1CPRU,2)
// SMT1CPRU<CPR19>
extern volatile __bit                   CPR19               __at(0x1F8BB);	// @ (0x3F17 * 8 + 3)
#define                                 CPR19_bit           _BIT_ACCESS(SMT1CPRU,3)
// SMT1CPRL<CPR2>
extern volatile __bit                   CPR2                __at(0x1F8AA);	// @ (0x3F15 * 8 + 2)
#define                                 CPR2_bit            _BIT_ACCESS(SMT1CPRL,2)
// SMT1CPRU<CPR20>
extern volatile __bit                   CPR20               __at(0x1F8BC);	// @ (0x3F17 * 8 + 4)
#define                                 CPR20_bit           _BIT_ACCESS(SMT1CPRU,4)
// SMT1CPRU<CPR21>
extern volatile __bit                   CPR21               __at(0x1F8BD);	// @ (0x3F17 * 8 + 5)
#define                                 CPR21_bit           _BIT_ACCESS(SMT1CPRU,5)
// SMT1CPRU<CPR22>
extern volatile __bit                   CPR22               __at(0x1F8BE);	// @ (0x3F17 * 8 + 6)
#define                                 CPR22_bit           _BIT_ACCESS(SMT1CPRU,6)
// SMT1CPRU<CPR23>
extern volatile __bit                   CPR23               __at(0x1F8BF);	// @ (0x3F17 * 8 + 7)
#define                                 CPR23_bit           _BIT_ACCESS(SMT1CPRU,7)
// SMT1CPRL<CPR3>
extern volatile __bit                   CPR3                __at(0x1F8AB);	// @ (0x3F15 * 8 + 3)
#define                                 CPR3_bit            _BIT_ACCESS(SMT1CPRL,3)
// SMT1CPRL<CPR4>
extern volatile __bit                   CPR4                __at(0x1F8AC);	// @ (0x3F15 * 8 + 4)
#define                                 CPR4_bit            _BIT_ACCESS(SMT1CPRL,4)
// SMT1CPRL<CPR5>
extern volatile __bit                   CPR5                __at(0x1F8AD);	// @ (0x3F15 * 8 + 5)
#define                                 CPR5_bit            _BIT_ACCESS(SMT1CPRL,5)
// SMT1CPRL<CPR6>
extern volatile __bit                   CPR6                __at(0x1F8AE);	// @ (0x3F15 * 8 + 6)
#define                                 CPR6_bit            _BIT_ACCESS(SMT1CPRL,6)
// SMT1CPRL<CPR7>
extern volatile __bit                   CPR7                __at(0x1F8AF);	// @ (0x3F15 * 8 + 7)
#define                                 CPR7_bit            _BIT_ACCESS(SMT1CPRL,7)
// SMT1CPRH<CPR8>
extern volatile __bit                   CPR8                __at(0x1F8B0);	// @ (0x3F16 * 8 + 0)
#define                                 CPR8_bit            _BIT_ACCESS(SMT1CPRH,0)
// SMT1CPRH<CPR9>
extern volatile __bit                   CPR9                __at(0x1F8B1);	// @ (0x3F16 * 8 + 1)
#define                                 CPR9_bit            _BIT_ACCESS(SMT1CPRH,1)
// ADCP<CPRDY>
extern volatile __bit                   CPRDY               __at(0x1F6B8);	// @ (0x3ED7 * 8 + 0)
#define                                 CPRDY_bit           _BIT_ACCESS(ADCP,0)
// SMT1STAT<CPRUP>
extern volatile __bit                   CPRUP               __at(0x1F907);	// @ (0x3F20 * 8 + 7)
#define                                 CPRUP_bit           _BIT_ACCESS(SMT1STAT,7)
// SMT1CPWL<CPW0>
extern volatile __bit                   CPW0                __at(0x1F8C0);	// @ (0x3F18 * 8 + 0)
#define                                 CPW0_bit            _BIT_ACCESS(SMT1CPWL,0)
// SMT1CPWL<CPW1>
extern volatile __bit                   CPW1                __at(0x1F8C1);	// @ (0x3F18 * 8 + 1)
#define                                 CPW1_bit            _BIT_ACCESS(SMT1CPWL,1)
// SMT1CPWH<CPW10>
extern volatile __bit                   CPW10               __at(0x1F8CA);	// @ (0x3F19 * 8 + 2)
#define                                 CPW10_bit           _BIT_ACCESS(SMT1CPWH,2)
// SMT1CPWH<CPW11>
extern volatile __bit                   CPW11               __at(0x1F8CB);	// @ (0x3F19 * 8 + 3)
#define                                 CPW11_bit           _BIT_ACCESS(SMT1CPWH,3)
// SMT1CPWH<CPW12>
extern volatile __bit                   CPW12               __at(0x1F8CC);	// @ (0x3F19 * 8 + 4)
#define                                 CPW12_bit           _BIT_ACCESS(SMT1CPWH,4)
// SMT1CPWH<CPW13>
extern volatile __bit                   CPW13               __at(0x1F8CD);	// @ (0x3F19 * 8 + 5)
#define                                 CPW13_bit           _BIT_ACCESS(SMT1CPWH,5)
// SMT1CPWH<CPW14>
extern volatile __bit                   CPW14               __at(0x1F8CE);	// @ (0x3F19 * 8 + 6)
#define                                 CPW14_bit           _BIT_ACCESS(SMT1CPWH,6)
// SMT1CPWH<CPW15>
extern volatile __bit                   CPW15               __at(0x1F8CF);	// @ (0x3F19 * 8 + 7)
#define                                 CPW15_bit           _BIT_ACCESS(SMT1CPWH,7)
// SMT1CPWU<CPW16>
extern volatile __bit                   CPW16               __at(0x1F8D0);	// @ (0x3F1A * 8 + 0)
#define                                 CPW16_bit           _BIT_ACCESS(SMT1CPWU,0)
// SMT1CPWU<CPW17>
extern volatile __bit                   CPW17               __at(0x1F8D1);	// @ (0x3F1A * 8 + 1)
#define                                 CPW17_bit           _BIT_ACCESS(SMT1CPWU,1)
// SMT1CPWU<CPW18>
extern volatile __bit                   CPW18               __at(0x1F8D2);	// @ (0x3F1A * 8 + 2)
#define                                 CPW18_bit           _BIT_ACCESS(SMT1CPWU,2)
// SMT1CPWU<CPW19>
extern volatile __bit                   CPW19               __at(0x1F8D3);	// @ (0x3F1A * 8 + 3)
#define                                 CPW19_bit           _BIT_ACCESS(SMT1CPWU,3)
// SMT1CPWL<CPW2>
extern volatile __bit                   CPW2                __at(0x1F8C2);	// @ (0x3F18 * 8 + 2)
#define                                 CPW2_bit            _BIT_ACCESS(SMT1CPWL,2)
// SMT1CPWU<CPW20>
extern volatile __bit                   CPW20               __at(0x1F8D4);	// @ (0x3F1A * 8 + 4)
#define                                 CPW20_bit           _BIT_ACCESS(SMT1CPWU,4)
// SMT1CPWU<CPW21>
extern volatile __bit                   CPW21               __at(0x1F8D5);	// @ (0x3F1A * 8 + 5)
#define                                 CPW21_bit           _BIT_ACCESS(SMT1CPWU,5)
// SMT1CPWU<CPW22>
extern volatile __bit                   CPW22               __at(0x1F8D6);	// @ (0x3F1A * 8 + 6)
#define                                 CPW22_bit           _BIT_ACCESS(SMT1CPWU,6)
// SMT1CPWU<CPW23>
extern volatile __bit                   CPW23               __at(0x1F8D7);	// @ (0x3F1A * 8 + 7)
#define                                 CPW23_bit           _BIT_ACCESS(SMT1CPWU,7)
// SMT1CPWL<CPW3>
extern volatile __bit                   CPW3                __at(0x1F8C3);	// @ (0x3F18 * 8 + 3)
#define                                 CPW3_bit            _BIT_ACCESS(SMT1CPWL,3)
// SMT1CPWL<CPW4>
extern volatile __bit                   CPW4                __at(0x1F8C4);	// @ (0x3F18 * 8 + 4)
#define                                 CPW4_bit            _BIT_ACCESS(SMT1CPWL,4)
// SMT1CPWL<CPW5>
extern volatile __bit                   CPW5                __at(0x1F8C5);	// @ (0x3F18 * 8 + 5)
#define                                 CPW5_bit            _BIT_ACCESS(SMT1CPWL,5)
// SMT1CPWL<CPW6>
extern volatile __bit                   CPW6                __at(0x1F8C6);	// @ (0x3F18 * 8 + 6)
#define                                 CPW6_bit            _BIT_ACCESS(SMT1CPWL,6)
// SMT1CPWL<CPW7>
extern volatile __bit                   CPW7                __at(0x1F8C7);	// @ (0x3F18 * 8 + 7)
#define                                 CPW7_bit            _BIT_ACCESS(SMT1CPWL,7)
// SMT1CPWH<CPW8>
extern volatile __bit                   CPW8                __at(0x1F8C8);	// @ (0x3F19 * 8 + 0)
#define                                 CPW8_bit            _BIT_ACCESS(SMT1CPWH,0)
// SMT1CPWH<CPW9>
extern volatile __bit                   CPW9                __at(0x1F8C9);	// @ (0x3F19 * 8 + 1)
#define                                 CPW9_bit            _BIT_ACCESS(SMT1CPWH,1)
// SMT1STAT<CPWUP>
extern volatile __bit                   CPWUP               __at(0x1F906);	// @ (0x3F20 * 8 + 6)
#define                                 CPWUP_bit           _BIT_ACCESS(SMT1STAT,6)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0x1CB47);	// @ (0x3968 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0x1CB46);	// @ (0x3968 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE0<CRCIE>
extern volatile __bit                   CRCIE               __at(0x1CC86);	// @ (0x3990 * 8 + 6)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE0,6)
// PIR0<CRCIF>
extern volatile __bit                   CRCIF               __at(0x1CD06);	// @ (0x39A0 * 8 + 6)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR0,6)
// IPR0<CRCIP>
extern volatile __bit                   CRCIP               __at(0x1CC06);	// @ (0x3980 * 8 + 6)
#define                                 CRCIP_bit           _BIT_ACCESS(IPR0,6)
// PMD0<CRCMD>
extern volatile __bit                   CRCMD               __at(0x1CE04);	// @ (0x39C0 * 8 + 4)
#define                                 CRCMD_bit           _BIT_ACCESS(PMD0,4)
// ADCON2<CRS0>
extern volatile __bit                   CRS0                __at(0x1F7D4);	// @ (0x3EFA * 8 + 4)
#define                                 CRS0_bit            _BIT_ACCESS(ADCON2,4)
// ADCON2<CRS1>
extern volatile __bit                   CRS1                __at(0x1F7D5);	// @ (0x3EFA * 8 + 5)
#define                                 CRS1_bit            _BIT_ACCESS(ADCON2,5)
// ADCON2<CRS2>
extern volatile __bit                   CRS2                __at(0x1F7D6);	// @ (0x3EFA * 8 + 6)
#define                                 CRS2_bit            _BIT_ACCESS(ADCON2,6)
// ADCLK<CS5>
extern volatile __bit                   CS5                 __at(0x1F7FD);	// @ (0x3EFF * 8 + 5)
#define                                 CS5_bit             _BIT_ACCESS(ADCLK,5)
// SMT1CLK<CSEL0>
extern volatile __bit                   CSEL0               __at(0x1F908);	// @ (0x3F21 * 8 + 0)
#define                                 CSEL0_bit           _BIT_ACCESS(SMT1CLK,0)
// SMT1CLK<CSEL1>
extern volatile __bit                   CSEL1               __at(0x1F909);	// @ (0x3F21 * 8 + 1)
#define                                 CSEL1_bit           _BIT_ACCESS(SMT1CLK,1)
// SMT1CLK<CSEL2>
extern volatile __bit                   CSEL2               __at(0x1F90A);	// @ (0x3F21 * 8 + 2)
#define                                 CSEL2_bit           _BIT_ACCESS(SMT1CLK,2)
// OSCCON3<CSWHOLD>
extern volatile __bit                   CSWHOLD             __at(0x1CEDF);	// @ (0x39DB * 8 + 7)
#define                                 CSWHOLD_bit         _BIT_ACCESS(OSCCON3,7)
// PIE0<CSWIE>
extern volatile __bit                   CSWIE               __at(0x1CC83);	// @ (0x3990 * 8 + 3)
#define                                 CSWIE_bit           _BIT_ACCESS(PIE0,3)
// PIR0<CSWIF>
extern volatile __bit                   CSWIF               __at(0x1CD03);	// @ (0x39A0 * 8 + 3)
#define                                 CSWIF_bit           _BIT_ACCESS(PIR0,3)
// IPR0<CSWIP>
extern volatile __bit                   CSWIP               __at(0x1CC03);	// @ (0x3980 * 8 + 3)
#define                                 CSWIP_bit           _BIT_ACCESS(IPR0,3)
// CWG1CLK<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0x1FA90);	// @ (0x3F52 * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLK,0)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x1FAA8);	// @ (0x3F55 * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0x1FAA9);	// @ (0x3F55 * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x1FAAA);	// @ (0x3F55 * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x1FAAB);	// @ (0x3F55 * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x1FAAC);	// @ (0x3F55 * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x1FAAD);	// @ (0x3F55 * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x1FAA0);	// @ (0x3F54 * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x1FAA1);	// @ (0x3F54 * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x1FAA2);	// @ (0x3F54 * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x1FAA3);	// @ (0x3F54 * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x1FAA4);	// @ (0x3F54 * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x1FAA5);	// @ (0x3F54 * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0x1FAB7);	// @ (0x3F56 * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// PIE4<CWG1IE>
extern volatile __bit                   CWG1IE              __at(0x1CCA6);	// @ (0x3994 * 8 + 6)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE4,6)
// PIR4<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0x1CD26);	// @ (0x39A4 * 8 + 6)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR4,6)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x1FABD);	// @ (0x3F57 * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// IPR4<CWG1IP>
extern volatile __bit                   CWG1IP              __at(0x1CC26);	// @ (0x3984 * 8 + 6)
#define                                 CWG1IP_bit          _BIT_ACCESS(IPR4,6)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x1FAB6);	// @ (0x3F56 * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x1FAC2);	// @ (0x3F58 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
